kengbailey/zclaw/sdkconfig.defaults
# Target: Waveshare ESP32-S3-Knob-Touch-LCD-1.8
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16MB, QIO mode
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# SPIRAM: 8MB octal mode
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU: dual-core at 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Cache for S3 with PSRAM
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Performance optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# mbedTLS - needed for HTTPS
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Logging (reduced for size)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
# With 16MB flash we can afford WPA3
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
# CONFIG_ESP_WIFI_ENABLE_SAE_PK is not set
# CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT is not set
# CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA is not set
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set

# TCP/IP stack (unused optional features disabled for size)
# CONFIG_LWIP_IPV6 is not set
# CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES is not set

# Watchdog - longer timeout for API calls
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60

# OTA updates
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# GPIO tool safety: allowlist for this board (avoid all reserved peripheral pins)
CONFIG_ZCLAW_GPIO_ALLOWED_PINS="35,36,37,38,43,44,48"

# When USB-C is oriented for the ESP32-S3, it connects directly to the S3's
# native USB Serial/JTAG interface (usbmodem). Use the default USB Serial/JTAG
# driver (not UART). Flip the USB-C cable to access the secondary ESP32 instead.
# CONFIG_ZCLAW_CHANNEL_UART is not set

# Factory reset pin: GPIO 9 is used by touch INT on this board, disable factory reset
CONFIG_ZCLAW_FACTORY_RESET_PIN=-1

# -------------------------------------------------------------------------
# LVGL configuration
# -------------------------------------------------------------------------
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=20
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
